tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "mongodb/brew"
tap "romkatv/powerlevel10k"
tap "samtay/tui"
tap "shaunsingh/sfmono-nerd-font-ligaturized"
# Aquarium animation in ASCII art
brew "asciiquarium"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Console Bonsai is a bonsai tree generator, written in C using ncurses
brew "cbonsai"
# Generic library support script
brew "libtool"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Simple, fast and user-friendly alternative to find
brew "fd"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Tool for glamorous shell scripts
brew "gum"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# X.509 and CMS library
brew "libksba"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Bare libuv bindings for lua
brew "luv"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node@16"
# Animated pipes terminal screensaver
brew "pipes-sh"
# Manage compile and link flags for libraries
brew "pkg-config"
# Theme for zsh
brew "powerlevel10k"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11", link: false
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Snake in your terminal
brew "samtay/tui/snake"
# Tetris in your terminal
brew "samtay/tui/tetris"
# Application uninstaller
cask "appcleaner"
# SFMono with Nerd Font Glyphs and Fira Code Ligatures
cask "font-sf-mono-nerd-font-ligaturized"
# Desktop automation application
cask "hammerspoon"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Control your tools with a few keystrokes
cask "raycast"
# Open-source code editor
cask "visual-studio-code"
vscode "ahmadawais.shades-of-purple"
vscode "akamud.vscode-theme-onedark"
vscode "bmewburn.vscode-intelephense-client"
vscode "Codeium.codeium"
vscode "lehni.vscode-titlebar-less-macos"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "mvllow.rose-pine"
vscode "PKief.material-icon-theme"
vscode "qufiwefefwoyn.kanagawa"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-russian"
vscode "teabyii.ayu"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "whizkydee.material-palenight-theme"
